Revit 2027 API
BuiltInFailures.RebarFailures.InvalidRebarHostWrongCategory Property
 Rebar can't be placed in a family of category [Name].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidRebarHostWrongCategory { get; }
Public Shared ReadOnly Property InvalidRebarHostWrongCategory As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidRebarHostWrongCategory {
	FailureDefinitionId^ get ();
}
static member InvalidRebarHostWrongCategory : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace